Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MM_GPM_DFP/1.3.50/include/proc/p32mm0064gpm028.h
extern volatile __CCP1BUFbits_t CCP1BUFbits __asm__ ("CCP1BUF") __attribute__((section("sfrs"), address(0xBF800180)));
extern volatile uint32_t        CCP1BUFCLR __attribute__((section("sfrs"),address(0xBF800184)));
extern volatile uint32_t        CCP1BUFSET __attribute__((section("sfrs"),address(0xBF800188)));
extern volatile uint32_t        CCP1BUFINV __attribute__((section("sfrs"),address(0xBF80018C)));
#define CCP2CON1 CCP2CON1
extern volatile uint32_t   CCP2CON1 __attribute__((section("sfrs"), address(0xBF800200)));
typedef struct {
  uint32_t MOD:4;
  uint32_t CCSEL:1;
  uint32_t T32:1;
  uint32_t TMRPS:2;
  uint32_t CLKSEL:3;
  uint32_t TMRSYNC:1;
  uint32_t CCPSLP:1;
  uint32_t SIDL:1;
  uint32_t :1;
  uint32_t ON:1;
  uint32_t SYNC:5;
  uint32_t ALTSYNC:1;
  uint32_t ONESHOT:1;
  uint32_t TRIGEN:1;
  uint32_t OPS:4;
  uint32_t :2;
  uint32_t RTRGEN:1;
  uint32_t OPSSRC:1;
} __CCP2CON1bits_t;
extern volatile __CCP2CON1bits_t CCP2CON1bits __asm__ ("CCP2CON1") __attribute__((section("sfrs"), address(0xBF800200)));
extern volatile uint32_t        CCP2CON1CLR __attribute__((section("sfrs"),address(0xBF800204)));
extern volatile uint32_t        CCP2CON1SET __attribute__((section("sfrs"),address(0xBF800208)));
extern volatile uint32_t        CCP2CON1INV __attribute__((section("sfrs"),address(0xBF80020C)));
#define CCP2CON2 CCP2CON2
extern volatile uint32_t   CCP2CON2 __attribute__((section("sfrs"), address(0xBF800210)));
typedef struct {
  uint32_t ASDG:8;
  uint32_t :4;
  uint32_t SSDG:1;
  uint32_t :1;
  uint32_t ASDGM:1;
  uint32_t PWMRSEN:1;
  uint32_t ICS:3;
  uint32_t AUXOUT:2;
  uint32_t :1;
  uint32_t ICGSM:2;
  uint32_t OCAEN:1;
  uint32_t OCBEN:1;
  uint32_t OCCEN:1;
  uint32_t OCDEN:1;
  uint32_t OCEEN:1;
  uint32_t OCFEN:1;
  uint32_t :1;
  uint32_t OENSYNC:1;
} __CCP2CON2bits_t;
extern volatile __CCP2CON2bits_t CCP2CON2bits __asm__ ("CCP2CON2") __attribute__((section("sfrs"), address(0xBF800210)));
extern volatile uint32_t        CCP2CON2CLR __attribute__((section("sfrs"),address(0xBF800214)));
extern volatile uint32_t        CCP2CON2SET __attribute__((section("sfrs"),address(0xBF800218)));
extern volatile uint32_t        CCP2CON2INV __attribute__((section("sfrs"),address(0xBF80021C)));
#define CCP2CON3 CCP2CON3
extern volatile uint32_t   CCP2CON3 __attribute__((section("sfrs"), address(0xBF800220)));
typedef struct {
  uint32_t DT:6;
  uint32_t :10;
  uint32_t PSSBDF:2;
  uint32_t PSSACE:2;
  uint32_t POLBDF:1;
  uint32_t POLACE:1;
  uint32_t :2;
  uint32_t OUTM:3;
  uint32_t :1;
  uint32_t OSCNT:3;
  uint32_t OETRIG:1;
} __CCP2CON3bits_t;
extern volatile __CCP2CON3bits_t CCP2CON3bits __asm__ ("CCP2CON3") __attribute__((section("sfrs"), address(0xBF800220)));
extern volatile uint32_t        CCP2CON3CLR __attribute__((section("sfrs"),address(0xBF800224)));
extern volatile uint32_t        CCP2CON3SET __attribute__((section("sfrs"),address(0xBF800228)));
extern volatile uint32_t        CCP2CON3INV __attribute__((section("sfrs"),address(0xBF80022C)));
#define CCP2STAT CCP2STAT
extern volatile uint32_t   CCP2STAT __attribute__((section("sfrs"), address(0xBF800230)));
typedef struct {
  uint32_t ICBNE:1;
  uint32_t ICOV:1;
  uint32_t ICDIS:1;
  uint32_t SCEVT:1;
  uint32_t ASEVT:1;
  uint32_t TRCLR:1;
  uint32_t TRSET:1;
  uint32_t CCPTRIG:1;
  uint32_t :2;
  uint32_t ICGARM:1;
  uint32_t :5;
  uint32_t RAWIP:1;
  uint32_t RBWIP:1;
  uint32_t TMRLWIP:1;
  uint32_t TMRHWIP:1;
  uint32_t PRLWIP:1;
} __CCP2STATbits_t;
extern volatile __CCP2STATbits_t CCP2STATbits __asm__ ("CCP2STAT") __attribute__((section("sfrs"), address(0xBF800230)));
extern volatile uint32_t        CCP2STATCLR __attribute__((section("sfrs"),address(0xBF800234)));
extern volatile uint32_t        CCP2STATSET __attribute__((section("sfrs"),address(0xBF800238)));
extern volatile uint32_t        CCP2STATINV __attribute__((section("sfrs"),address(0xBF80023C)));
#define CCP2TMR CCP2TMR
extern volatile uint32_t   CCP2TMR __attribute__((section("sfrs"), address(0xBF800240)));
typedef union {
  struct {
    uint32_t TMRL:16;
    uint32_t TMRH:16;
  };
  struct {
    uint32_t TMR:32;
  };
} __CCP2TMRbits_t;
extern volatile __CCP2TMRbits_t CCP2TMRbits __asm__ ("CCP2TMR") __attribute__((section("sfrs"), address(0xBF800240)));
extern volatile uint32_t        CCP2TMRCLR __attribute__((section("sfrs"),address(0xBF800244)));
extern volatile uint32_t        CCP2TMRSET __attribute__((section("sfrs"),address(0xBF800248)));
extern volatile uint32_t        CCP2TMRINV __attribute__((section("sfrs"),address(0xBF80024C)));
#define CCP2PR CCP2PR
extern volatile uint32_t   CCP2PR __attribute__((section("sfrs"), address(0xBF800250)));
typedef union {
  struct {
    uint32_t PRL:16;
    uint32_t PRH:16;
  };
  struct {
    uint32_t PR:32;
  };
} __CCP2PRbits_t;
extern volatile __CCP2PRbits_t CCP2PRbits __asm__ ("CCP2PR") __attribute__((section("sfrs"), address(0xBF800250)));
extern volatile uint32_t        CCP2PRCLR __attribute__((section("sfrs"),address(0xBF800254)));
extern volatile uint32_t        CCP2PRSET __attribute__((section("sfrs"),address(0xBF800258)));
extern volatile uint32_t        CCP2PRINV __attribute__((section("sfrs"),address(0xBF80025C)));
#define CCP2RA CCP2RA
extern volatile uint32_t   CCP2RA __attribute__((section("sfrs"), address(0xBF800260)));
typedef struct {
  uint32_t CMPA:16;
} __CCP2RAbits_t;
extern volatile __CCP2RAbits_t CCP2RAbits __asm__ ("CCP2RA") __attribute__((section("sfrs"), address(0xBF800260)));
extern volatile uint32_t        CCP2RACLR __attribute__((section("sfrs"),address(0xBF800264)));
extern volatile uint32_t        CCP2RASET __attribute__((section("sfrs"),address(0xBF800268)));
extern volatile uint32_t        CCP2RAINV __attribute__((section("sfrs"),address(0xBF80026C)));
#define CCP2RB CCP2RB
extern volatile uint32_t   CCP2RB __attribute__((section("sfrs"), address(0xBF800270)));
typedef struct {
  uint32_t CMPB:16;
} __CCP2RBbits_t;
extern volatile __CCP2RBbits_t CCP2RBbits __asm__ ("CCP2RB") __attribute__((section("sfrs"), address(0xBF800270)));
extern volatile uint32_t        CCP2RBCLR __attribute__((section("sfrs"),address(0xBF800274)));
extern volatile uint32_t        CCP2RBSET __attribute__((section("sfrs"),address(0xBF800278)));
extern volatile uint32_t        CCP2RBINV __attribute__((section("sfrs"),address(0xBF80027C)));
#define CCP2BUF CCP2BUF
extern volatile uint32_t   CCP2BUF __attribute__((section("sfrs"), address(0xBF800280)));
typedef union {
  struct {
    uint32_t BUFL:16;
    uint32_t BUFH:16;
  };
  struct {
    uint32_t BUF:32;
  };
} __CCP2BUFbits_t;
extern volatile __CCP2BUFbits_t CCP2BUFbits __asm__ ("CCP2BUF") __attribute__((section("sfrs"), address(0xBF800280)));
extern volatile uint32_t        CCP2BUFCLR __attribute__((section("sfrs"),address(0xBF800284)));
extern volatile uint32_t        CCP2BUFSET __attribute__((section("sfrs"),address(0xBF800288)));
extern volatile uint32_t        CCP2BUFINV __attribute__((section("sfrs"),address(0xBF80028C)));
#define CCP3CON1 CCP3CON1
extern volatile uint32_t   CCP3CON1 __attribute__((section("sfrs"), address(0xBF800300)));
typedef struct {
  uint32_t MOD:4;
  uint32_t CCSEL:1;
  uint32_t T32:1;
  uint32_t TMRPS:2;
  uint32_t CLKSEL:3;
  uint32_t TMRSYNC:1;
  uint32_t CCPSLP:1;
  uint32_t SIDL:1;
  uint32_t :1;
  uint32_t ON:1;
  uint32_t SYNC:5;
  uint32_t ALTSYNC:1;
  uint32_t ONESHOT:1;
  uint32_t TRIGEN:1;
  uint32_t OPS:4;
  uint32_t :2;
  uint32_t RTRGEN:1;
  uint32_t OPSSRC:1;
} __CCP3CON1bits_t;
extern volatile __CCP3CON1bits_t CCP3CON1bits __asm__ ("CCP3CON1") __attribute__((section("sfrs"), address(0xBF800300)));
extern volatile uint32_t        CCP3CON1CLR __attribute__((section("sfrs"),address(0xBF800304)));
extern volatile uint32_t        CCP3CON1SET __attribute__((section("sfrs"),address(0xBF800308)));
extern volatile uint32_t        CCP3CON1INV __attribute__((section("sfrs"),address(0xBF80030C)));
#define CCP3CON2 CCP3CON2
extern volatile uint32_t   CCP3CON2 __attribute__((section("sfrs"), address(0xBF800310)));
typedef struct {
  uint32_t ASDG:8;
  uint32_t :4;
  uint32_t SSDG:1;
  uint32_t :1;
  uint32_t ASDGM:1;
  uint32_t PWMRSEN:1;
  uint32_t ICS:3;
  uint32_t AUXOUT:2;
  uint32_t :1;
  uint32_t ICGSM:2;
  uint32_t OCAEN:1;
  uint32_t OCBEN:1;
  uint32_t OCCEN:1;
  uint32_t OCDEN:1;
  uint32_t OCEEN:1;
  uint32_t OCFEN:1;
  uint32_t :1;
  uint32_t OENSYNC:1;
} __CCP3CON2bits_t;
extern volatile __CCP3CON2bits_t CCP3CON2bits __asm__ ("CCP3CON2") __attribute__((section("sfrs"), address(0xBF800310)));
extern volatile uint32_t        CCP3CON2CLR __attribute__((section("sfrs"),address(0xBF800314)));
extern volatile uint32_t        CCP3CON2SET __attribute__((section("sfrs"),address(0xBF800318)));
extern volatile uint32_t        CCP3CON2INV __attribute__((section("sfrs"),address(0xBF80031C)));
#define CCP3CON3 CCP3CON3
extern volatile uint32_t   CCP3CON3 __attribute__((section("sfrs"), address(0xBF800320)));
typedef struct {
  uint32_t DT:6;
  uint32_t :10;
  uint32_t PSSBDF:2;
  uint32_t PSSACE:2;
  uint32_t POLBDF:1;
  uint32_t POLACE:1;
  uint32_t :2;
  uint32_t OUTM:3;
  uint32_t :1;
  uint32_t OSCNT:3;
  uint32_t OETRIG:1;
} __CCP3CON3bits_t;
extern volatile __CCP3CON3bits_t CCP3CON3bits __asm__ ("CCP3CON3") __attribute__((section("sfrs"), address(0xBF800320)));
extern volatile uint32_t        CCP3CON3CLR __attribute__((section("sfrs"),address(0xBF800324)));
extern volatile uint32_t        CCP3CON3SET __attribute__((section("sfrs"),address(0xBF800328)));
extern volatile uint32_t        CCP3CON3INV __attribute__((section("sfrs"),address(0xBF80032C)));
#define CCP3STAT CCP3STAT
extern volatile uint32_t   CCP3STAT __attribute__((section("sfrs"), address(0xBF800330)));
typedef struct {
  uint32_t ICBNE:1;
  uint32_t ICOV:1;
  uint32_t ICDIS:1;
  uint32_t SCEVT:1;
  uint32_t ASEVT:1;
  uint32_t TRCLR:1;
  uint32_t TRSET:1;
  uint32_t CCPTRIG:1;
  uint32_t :2;
  uint32_t ICGARM:1;
  uint32_t :5;
  uint32_t RAWIP:1;
  uint32_t RBWIP:1;
  uint32_t TMRLWIP:1;
  uint32_t TMRHWIP:1;
  uint32_t PRLWIP:1;
} __CCP3STATbits_t;
extern volatile __CCP3STATbits_t CCP3STATbits __asm__ ("CCP3STAT") __attribute__((section("sfrs"), address(0xBF800330)));
extern volatile uint32_t        CCP3STATCLR __attribute__((section("sfrs"),address(0xBF800334)));
extern volatile uint32_t        CCP3STATSET __attribute__((section("sfrs"),address(0xBF800338)));
extern volatile uint32_t        CCP3STATINV __attribute__((section("sfrs"),address(0xBF80033C)));
#define CCP3TMR CCP3TMR
extern volatile uint32_t   CCP3TMR __attribute__((section("sfrs"), address(0xBF800340)));
typedef union {
  struct {
    uint32_t TMRL:16;
    uint32_t TMRH:16;
  };
  struct {
    uint32_t TMR:32;
  };
} __CCP3TMRbits_t;
extern volatile __CCP3TMRbits_t CCP3TMRbits __asm__ ("CCP3TMR") __attribute__((section("sfrs"), address(0xBF800340)));
extern volatile uint32_t        CCP3TMRCLR __attribute__((section("sfrs"),address(0xBF800344)));
extern volatile uint32_t        CCP3TMRSET __attribute__((section("sfrs"),address(0xBF800348)));
extern volatile uint32_t        CCP3TMRINV __attribute__((section("sfrs"),address(0xBF80034C)));
#define CCP3PR CCP3PR
extern volatile uint32_t   CCP3PR __attribute__((section("sfrs"), address(0xBF800350)));
typedef union {
  struct {
    uint32_t PRL:16;
    uint32_t PRH:16;
  };
  struct {
    uint32_t PR:32;
  };
} __CCP3PRbits_t;
extern volatile __CCP3PRbits_t CCP3PRbits __asm__ ("CCP3PR") __attribute__((section("sfrs"), address(0xBF800350)));
extern volatile uint32_t        CCP3PRCLR __attribute__((section("sfrs"),address(0xBF800354)));
extern volatile uint32_t        CCP3PRSET __attribute__((section("sfrs"),address(0xBF800358)));
extern volatile uint32_t        CCP3PRINV __attribute__((section("sfrs"),address(0xBF80035C)));
#define CCP3RA CCP3RA
extern volatile uint32_t   CCP3RA __attribute__((section("sfrs"), address(0xBF800360)));
typedef struct {
  uint32_t CMPA:16;
} __CCP3RAbits_t;
extern volatile __CCP3RAbits_t CCP3RAbits __asm__ ("CCP3RA") __attribute__((section("sfrs"), address(0xBF800360)));
extern volatile uint32_t        CCP3RACLR __attribute__((section("sfrs"),address(0xBF800364)));
extern volatile uint32_t        CCP3RASET __attribute__((section("sfrs"),address(0xBF800368)));
extern volatile uint32_t        CCP3RAINV __attribute__((section("sfrs"),address(0xBF80036C)));
#define CCP3RB CCP3RB
extern volatile uint32_t   CCP3RB __attribute__((section("sfrs"), address(0xBF800370)));
typedef struct {
  uint32_t CMPB:16;
} __CCP3RBbits_t;
extern volatile __CCP3RBbits_t CCP3RBbits __asm__ ("CCP3RB") __attribute__((section("sfrs"), address(0xBF800370)));
extern volatile uint32_t        CCP3RBCLR __attribute__((section("sfrs"),address(0xBF800374)));
extern volatile uint32_t        CCP3RBSET __attribute__((section("sfrs"),address(0xBF800378)));
extern volatile uint32_t        CCP3RBINV __attribute__((section("sfrs"),address(0xBF80037C)));
#define CCP3BUF CCP3BUF
extern volatile uint32_t   CCP3BUF __attribute__((section("sfrs"), address(0xBF800380)));
typedef union {
  struct {
    uint32_t BUFL:16;
    uint32_t BUFH:16;
  };
  struct {
    uint32_t BUF:32;
  };
} __CCP3BUFbits_t;
extern volatile __CCP3BUFbits_t CCP3BUFbits __asm__ ("CCP3BUF") __attribute__((section("sfrs"), address(0xBF800380)));
extern volatile uint32_t        CCP3BUFCLR __attribute__((section("sfrs"),address(0xBF800384)));
extern volatile uint32_t        CCP3BUFSET __attribute__((section("sfrs"),address(0xBF800388)));
extern volatile uint32_t        CCP3BUFINV __attribute__((section("sfrs"),address(0xBF80038C)));
#define CCP4CON1 CCP4CON1
extern volatile uint32_t   CCP4CON1 __attribute__((section("sfrs"), address(0xBF800400)));
typedef struct {
  uint32_t MOD:4;
  uint32_t CCSEL:1;
  uint32_t T32:1;
  uint32_t TMRPS:2;
  uint32_t CLKSEL:3;
  uint32_t TMRSYNC:1;
  uint32_t CCPSLP:1;
  uint32_t SIDL:1;
  uint32_t :1;
  uint32_t ON:1;
  uint32_t SYNC:5;
  uint32_t ALTSYNC:1;
  uint32_t ONESHOT:1;
  uint32_t TRIGEN:1;
  uint32_t OPS:4;
  uint32_t :2;
  uint32_t RTRGEN:1;
  uint32_t OPSSRC:1;
} __CCP4CON1bits_t;
