Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MM_GPM_DFP/1.3.50/include/proc/p32mm0064gpm028.h
extern volatile __CCP6CON1bits_t CCP6CON1bits __asm__ ("CCP6CON1") __attribute__((section("sfrs"), address(0xBF800600)));
extern volatile uint32_t        CCP6CON1CLR __attribute__((section("sfrs"),address(0xBF800604)));
extern volatile uint32_t        CCP6CON1SET __attribute__((section("sfrs"),address(0xBF800608)));
extern volatile uint32_t        CCP6CON1INV __attribute__((section("sfrs"),address(0xBF80060C)));
#define CCP6CON2 CCP6CON2
extern volatile uint32_t   CCP6CON2 __attribute__((section("sfrs"), address(0xBF800610)));
typedef struct {
  uint32_t ASDG:8;
  uint32_t :4;
  uint32_t SSDG:1;
  uint32_t :1;
  uint32_t ASDGM:1;
  uint32_t PWMRSEN:1;
  uint32_t ICS:3;
  uint32_t AUXOUT:2;
  uint32_t :1;
  uint32_t ICGSM:2;
  uint32_t OCAEN:1;
  uint32_t :6;
  uint32_t OENSYNC:1;
} __CCP6CON2bits_t;
extern volatile __CCP6CON2bits_t CCP6CON2bits __asm__ ("CCP6CON2") __attribute__((section("sfrs"), address(0xBF800610)));
extern volatile uint32_t        CCP6CON2CLR __attribute__((section("sfrs"),address(0xBF800614)));
extern volatile uint32_t        CCP6CON2SET __attribute__((section("sfrs"),address(0xBF800618)));
extern volatile uint32_t        CCP6CON2INV __attribute__((section("sfrs"),address(0xBF80061C)));
#define CCP6CON3 CCP6CON3
extern volatile uint32_t   CCP6CON3 __attribute__((section("sfrs"), address(0xBF800620)));
typedef struct {
  uint32_t :18;
  uint32_t PSSACE:2;
  uint32_t :1;
  uint32_t POLACE:1;
  uint32_t :6;
  uint32_t OSCNT:3;
  uint32_t OETRIG:1;
} __CCP6CON3bits_t;
extern volatile __CCP6CON3bits_t CCP6CON3bits __asm__ ("CCP6CON3") __attribute__((section("sfrs"), address(0xBF800620)));
extern volatile uint32_t        CCP6CON3CLR __attribute__((section("sfrs"),address(0xBF800624)));
extern volatile uint32_t        CCP6CON3SET __attribute__((section("sfrs"),address(0xBF800628)));
extern volatile uint32_t        CCP6CON3INV __attribute__((section("sfrs"),address(0xBF80062C)));
#define CCP6STAT CCP6STAT
extern volatile uint32_t   CCP6STAT __attribute__((section("sfrs"), address(0xBF800630)));
typedef struct {
  uint32_t ICBNE:1;
  uint32_t ICOV:1;
  uint32_t ICDIS:1;
  uint32_t SCEVT:1;
  uint32_t ASEVT:1;
  uint32_t TRCLR:1;
  uint32_t TRSET:1;
  uint32_t CCPTRIG:1;
  uint32_t :2;
  uint32_t ICGARM:1;
  uint32_t :5;
  uint32_t RAWIP:1;
  uint32_t RBWIP:1;
  uint32_t TMRLWIP:1;
  uint32_t TMRHWIP:1;
  uint32_t PRLWIP:1;
} __CCP6STATbits_t;
extern volatile __CCP6STATbits_t CCP6STATbits __asm__ ("CCP6STAT") __attribute__((section("sfrs"), address(0xBF800630)));
extern volatile uint32_t        CCP6STATCLR __attribute__((section("sfrs"),address(0xBF800634)));
extern volatile uint32_t        CCP6STATSET __attribute__((section("sfrs"),address(0xBF800638)));
extern volatile uint32_t        CCP6STATINV __attribute__((section("sfrs"),address(0xBF80063C)));
#define CCP6TMR CCP6TMR
extern volatile uint32_t   CCP6TMR __attribute__((section("sfrs"), address(0xBF800640)));
typedef union {
  struct {
    uint32_t TMRL:16;
    uint32_t TMRH:16;
  };
  struct {
    uint32_t TMR:32;
  };
} __CCP6TMRbits_t;
extern volatile __CCP6TMRbits_t CCP6TMRbits __asm__ ("CCP6TMR") __attribute__((section("sfrs"), address(0xBF800640)));
extern volatile uint32_t        CCP6TMRCLR __attribute__((section("sfrs"),address(0xBF800644)));
extern volatile uint32_t        CCP6TMRSET __attribute__((section("sfrs"),address(0xBF800648)));
extern volatile uint32_t        CCP6TMRINV __attribute__((section("sfrs"),address(0xBF80064C)));
#define CCP6PR CCP6PR
extern volatile uint32_t   CCP6PR __attribute__((section("sfrs"), address(0xBF800650)));
typedef union {
  struct {
    uint32_t PRL:16;
    uint32_t PRH:16;
  };
  struct {
    uint32_t PR:32;
  };
} __CCP6PRbits_t;
extern volatile __CCP6PRbits_t CCP6PRbits __asm__ ("CCP6PR") __attribute__((section("sfrs"), address(0xBF800650)));
extern volatile uint32_t        CCP6PRCLR __attribute__((section("sfrs"),address(0xBF800654)));
extern volatile uint32_t        CCP6PRSET __attribute__((section("sfrs"),address(0xBF800658)));
extern volatile uint32_t        CCP6PRINV __attribute__((section("sfrs"),address(0xBF80065C)));
#define CCP6RA CCP6RA
extern volatile uint32_t   CCP6RA __attribute__((section("sfrs"), address(0xBF800660)));
typedef struct {
  uint32_t CMPA:16;
} __CCP6RAbits_t;
extern volatile __CCP6RAbits_t CCP6RAbits __asm__ ("CCP6RA") __attribute__((section("sfrs"), address(0xBF800660)));
extern volatile uint32_t        CCP6RACLR __attribute__((section("sfrs"),address(0xBF800664)));
extern volatile uint32_t        CCP6RASET __attribute__((section("sfrs"),address(0xBF800668)));
extern volatile uint32_t        CCP6RAINV __attribute__((section("sfrs"),address(0xBF80066C)));
#define CCP6RB CCP6RB
extern volatile uint32_t   CCP6RB __attribute__((section("sfrs"), address(0xBF800670)));
typedef struct {
  uint32_t CMPB:16;
} __CCP6RBbits_t;
extern volatile __CCP6RBbits_t CCP6RBbits __asm__ ("CCP6RB") __attribute__((section("sfrs"), address(0xBF800670)));
extern volatile uint32_t        CCP6RBCLR __attribute__((section("sfrs"),address(0xBF800674)));
extern volatile uint32_t        CCP6RBSET __attribute__((section("sfrs"),address(0xBF800678)));
extern volatile uint32_t        CCP6RBINV __attribute__((section("sfrs"),address(0xBF80067C)));
#define CCP6BUF CCP6BUF
extern volatile uint32_t   CCP6BUF __attribute__((section("sfrs"), address(0xBF800680)));
typedef union {
  struct {
    uint32_t BUFL:16;
    uint32_t BUFH:16;
  };
  struct {
    uint32_t BUF:32;
  };
} __CCP6BUFbits_t;
extern volatile __CCP6BUFbits_t CCP6BUFbits __asm__ ("CCP6BUF") __attribute__((section("sfrs"), address(0xBF800680)));
extern volatile uint32_t        CCP6BUFCLR __attribute__((section("sfrs"),address(0xBF800684)));
extern volatile uint32_t        CCP6BUFSET __attribute__((section("sfrs"),address(0xBF800688)));
extern volatile uint32_t        CCP6BUFINV __attribute__((section("sfrs"),address(0xBF80068C)));
#define CCP7CON1 CCP7CON1
extern volatile uint32_t   CCP7CON1 __attribute__((section("sfrs"), address(0xBF800700)));
typedef struct {
  uint32_t MOD:4;
  uint32_t CCSEL:1;
  uint32_t T32:1;
  uint32_t TMRPS:2;
  uint32_t CLKSEL:3;
  uint32_t TMRSYNC:1;
  uint32_t CCPSLP:1;
  uint32_t SIDL:1;
  uint32_t :1;
  uint32_t ON:1;
  uint32_t SYNC:5;
  uint32_t ALTSYNC:1;
  uint32_t ONESHOT:1;
  uint32_t TRIGEN:1;
  uint32_t OPS:4;
  uint32_t :2;
  uint32_t RTRGEN:1;
  uint32_t OPSSRC:1;
} __CCP7CON1bits_t;
