Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MM_GPM_DFP/1.3.50/include/proc/p32mm0064gpm028.h
#define _IPC1_INT4IS_POSITION                    0x00000018
#define _IPC1_INT4IS_MASK                        0x03000000
#define _IPC1_INT4IS_LENGTH                      0x00000002

#define _IPC1_INT4IP_POSITION                    0x0000001A
#define _IPC1_INT4IP_MASK                        0x1C000000
#define _IPC1_INT4IP_LENGTH                      0x00000003

#define _IPC2_CNAIS_POSITION                     0x00000000
#define _IPC2_CNAIS_MASK                         0x00000003
#define _IPC2_CNAIS_LENGTH                       0x00000002

#define _IPC2_CNAIP_POSITION                     0x00000002
#define _IPC2_CNAIP_MASK                         0x0000001C
#define _IPC2_CNAIP_LENGTH                       0x00000003

#define _IPC2_CNBIS_POSITION                     0x00000008
#define _IPC2_CNBIS_MASK                         0x00000300
#define _IPC2_CNBIS_LENGTH                       0x00000002

#define _IPC2_CNBIP_POSITION                     0x0000000A
#define _IPC2_CNBIP_MASK                         0x00001C00
#define _IPC2_CNBIP_LENGTH                       0x00000003

#define _IPC2_CNCIS_POSITION                     0x00000010
#define _IPC2_CNCIS_MASK                         0x00030000
#define _IPC2_CNCIS_LENGTH                       0x00000002

#define _IPC2_CNCIP_POSITION                     0x00000012
#define _IPC2_CNCIP_MASK                         0x001C0000
#define _IPC2_CNCIP_LENGTH                       0x00000003

#define _IPC2_CNDIS_POSITION                     0x00000018
#define _IPC2_CNDIS_MASK                         0x03000000
#define _IPC2_CNDIS_LENGTH                       0x00000002

#define _IPC2_CNDIP_POSITION                     0x0000001A
#define _IPC2_CNDIP_MASK                         0x1C000000
#define _IPC2_CNDIP_LENGTH                       0x00000003

#define _IPC4_T1IS_POSITION                      0x00000008
#define _IPC4_T1IS_MASK                          0x00000300
#define _IPC4_T1IS_LENGTH                        0x00000002

#define _IPC4_T1IP_POSITION                      0x0000000A
#define _IPC4_T1IP_MASK                          0x00001C00
#define _IPC4_T1IP_LENGTH                        0x00000003

#define _IPC4_T2IS_POSITION                      0x00000010
#define _IPC4_T2IS_MASK                          0x00030000
#define _IPC4_T2IS_LENGTH                        0x00000002

#define _IPC4_T2IP_POSITION                      0x00000012
#define _IPC4_T2IP_MASK                          0x001C0000
#define _IPC4_T2IP_LENGTH                        0x00000003

#define _IPC4_T3IS_POSITION                      0x00000018
#define _IPC4_T3IS_MASK                          0x03000000
#define _IPC4_T3IS_LENGTH                        0x00000002

#define _IPC4_T3IP_POSITION                      0x0000001A
#define _IPC4_T3IP_MASK                          0x1C000000
#define _IPC4_T3IP_LENGTH                        0x00000003

#define _IPC5_CMP1IS_POSITION                    0x00000018
#define _IPC5_CMP1IS_MASK                        0x03000000
#define _IPC5_CMP1IS_LENGTH                      0x00000002

#define _IPC5_CMP1IP_POSITION                    0x0000001A
#define _IPC5_CMP1IP_MASK                        0x1C000000
#define _IPC5_CMP1IP_LENGTH                      0x00000003

#define _IPC6_CMP2IS_POSITION                    0x00000000
#define _IPC6_CMP2IS_MASK                        0x00000003
#define _IPC6_CMP2IS_LENGTH                      0x00000002

#define _IPC6_CMP2IP_POSITION                    0x00000002
#define _IPC6_CMP2IP_MASK                        0x0000001C
#define _IPC6_CMP2IP_LENGTH                      0x00000003

#define _IPC6_CMP3IS_POSITION                    0x00000008
#define _IPC6_CMP3IS_MASK                        0x00000300
#define _IPC6_CMP3IS_LENGTH                      0x00000002

#define _IPC6_CMP3IP_POSITION                    0x0000000A
#define _IPC6_CMP3IP_MASK                        0x00001C00
#define _IPC6_CMP3IP_LENGTH                      0x00000003

#define _IPC7_USBIS_POSITION                     0x00000008
#define _IPC7_USBIS_MASK                         0x00000300
#define _IPC7_USBIS_LENGTH                       0x00000002

#define _IPC7_USBIP_POSITION                     0x0000000A
#define _IPC7_USBIP_MASK                         0x00001C00
#define _IPC7_USBIP_LENGTH                       0x00000003

#define _IPC8_RTCCIS_POSITION                    0x00000000
#define _IPC8_RTCCIS_MASK                        0x00000003
#define _IPC8_RTCCIS_LENGTH                      0x00000002

#define _IPC8_RTCCIP_POSITION                    0x00000002
#define _IPC8_RTCCIP_MASK                        0x0000001C
#define _IPC8_RTCCIP_LENGTH                      0x00000003

#define _IPC8_AD1IS_POSITION                     0x00000008
#define _IPC8_AD1IS_MASK                         0x00000300
#define _IPC8_AD1IS_LENGTH                       0x00000002

#define _IPC8_AD1IP_POSITION                     0x0000000A
#define _IPC8_AD1IP_MASK                         0x00001C00
#define _IPC8_AD1IP_LENGTH                       0x00000003

#define _IPC9_LVDIS_POSITION                     0x00000000
#define _IPC9_LVDIS_MASK                         0x00000003
#define _IPC9_LVDIS_LENGTH                       0x00000002

#define _IPC9_LVDIP_POSITION                     0x00000002
#define _IPC9_LVDIP_MASK                         0x0000001C
#define _IPC9_LVDIP_LENGTH                       0x00000003

#define _IPC9_CLC1IS_POSITION                    0x00000008
#define _IPC9_CLC1IS_MASK                        0x00000300
#define _IPC9_CLC1IS_LENGTH                      0x00000002

#define _IPC9_CLC1IP_POSITION                    0x0000000A
#define _IPC9_CLC1IP_MASK                        0x00001C00
#define _IPC9_CLC1IP_LENGTH                      0x00000003

#define _IPC9_CLC2IS_POSITION                    0x00000010
#define _IPC9_CLC2IS_MASK                        0x00030000
#define _IPC9_CLC2IS_LENGTH                      0x00000002

#define _IPC9_CLC2IP_POSITION                    0x00000012
#define _IPC9_CLC2IP_MASK                        0x001C0000
#define _IPC9_CLC2IP_LENGTH                      0x00000003

#define _IPC9_CLC3IS_POSITION                    0x00000018
#define _IPC9_CLC3IS_MASK                        0x03000000
#define _IPC9_CLC3IS_LENGTH                      0x00000002

#define _IPC9_CLC3IP_POSITION                    0x0000001A
#define _IPC9_CLC3IP_MASK                        0x1C000000
#define _IPC9_CLC3IP_LENGTH                      0x00000003

#define _IPC10_CLC4IS_POSITION                   0x00000000
#define _IPC10_CLC4IS_MASK                       0x00000003
#define _IPC10_CLC4IS_LENGTH                     0x00000002

