Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MM_GPM_DFP/1.3.50/include/proc/p32mm0064gpm028.h
#define _AFOSCSEL_IESO_POSITION                  0x00000007
#define _AFOSCSEL_IESO_MASK                      0x00000080
#define _AFOSCSEL_IESO_LENGTH                    0x00000001

#define _AFOSCSEL_POSCMOD_POSITION               0x00000008
#define _AFOSCSEL_POSCMOD_MASK                   0x00000300
#define _AFOSCSEL_POSCMOD_LENGTH                 0x00000002

#define _AFOSCSEL_OSCIOFNC_POSITION              0x0000000A
#define _AFOSCSEL_OSCIOFNC_MASK                  0x00000400
#define _AFOSCSEL_OSCIOFNC_LENGTH                0x00000001

#define _AFOSCSEL_SOSCSEL_POSITION               0x0000000C
#define _AFOSCSEL_SOSCSEL_MASK                   0x00001000
#define _AFOSCSEL_SOSCSEL_LENGTH                 0x00000001

#define _AFOSCSEL_FCKSM_POSITION                 0x0000000E
#define _AFOSCSEL_FCKSM_MASK                     0x0000C000
#define _AFOSCSEL_FCKSM_LENGTH                   0x00000002

#define _AFOSCSEL_w_POSITION                     0x00000000
#define _AFOSCSEL_w_MASK                         0xFFFFFFFF
#define _AFOSCSEL_w_LENGTH                       0x00000020

#define _AFSEC_CP_POSITION                       0x0000001F
#define _AFSEC_CP_MASK                           0x80000000
#define _AFSEC_CP_LENGTH                         0x00000001

#define _AFSEC_w_POSITION                        0x00000000
#define _AFSEC_w_MASK                            0xFFFFFFFF
#define _AFSEC_w_LENGTH                          0x00000020

/* Vector Numbers */
#define _CORE_TIMER_VECTOR                       0
#define _CORE_SOFTWARE_0_VECTOR                  1
#define _CORE_SOFTWARE_1_VECTOR                  2
#define _EXTERNAL_0_VECTOR                       3
#define _EXTERNAL_1_VECTOR                       4
#define _EXTERNAL_2_VECTOR                       5
#define _EXTERNAL_3_VECTOR                       6
#define _EXTERNAL_4_VECTOR                       7
#define _CHANGE_NOTICE_A_VECTOR                  8
#define _CHANGE_NOTICE_B_VECTOR                  9
#define _CHANGE_NOTICE_C_VECTOR                  10
#define _CHANGE_NOTICE_D_VECTOR                  11
#define _TIMER_1_VECTOR                          17
#define _TIMER_2_VECTOR                          18
#define _TIMER_3_VECTOR                          19
#define _COMPARATOR_1_VECTOR                     23
#define _COMPARATOR_2_VECTOR                     24
#define _COMPARATOR_3_VECTOR                     25
#define _USB_VECTOR                              29
#define _RTCC_VECTOR                             32
#define _ADC_VECTOR                              33
#define _HLVD_VECTOR                             36
#define _CLC1_VECTOR                             37
#define _CLC2_VECTOR                             38
#define _CLC3_VECTOR                             39
#define _CLC4_VECTOR                             40
#define _SPI1_ERR_VECTOR                         41
#define _SPI1_TX_VECTOR                          42
#define _SPI1_RX_VECTOR                          43
#define _SPI2_ERR_VECTOR                         44
#define _SPI2_TX_VECTOR                          45
#define _SPI2_RX_VECTOR                          46
#define _SPI3_ERR_VECTOR                         47
#define _SPI3_TX_VECTOR                          48
#define _SPI3_RX_VECTOR                          49
#define _UART1_RX_VECTOR                         53
#define _UART1_TX_VECTOR                         54
#define _UART1_ERR_VECTOR                        55
#define _UART2_RX_VECTOR                         56
#define _UART2_TX_VECTOR                         57
#define _UART2_ERR_VECTOR                        58
#define _UART3_RX_VECTOR                         59
#define _UART3_TX_VECTOR                         60
#define _UART3_ERR_VECTOR                        61
#define _I2C1_SLAVE_VECTOR                       65
#define _I2C1_MASTER_VECTOR                      66
#define _I2C1_BUS_VECTOR                         67
#define _I2C2_SLAVE_VECTOR                       68
#define _I2C2_MASTER_VECTOR                      69
#define _I2C2_BUS_VECTOR                         70
#define _I2C3_SLAVE_VECTOR                       71
#define _I2C3_MASTER_VECTOR                      72
#define _I2C3_BUS_VECTOR                         73
#define _CCP1_VECTOR                             74
#define _CCT1_VECTOR                             75
#define _CCP2_VECTOR                             76
#define _CCT2_VECTOR                             77
#define _CCP3_VECTOR                             78
#define _CCT3_VECTOR                             79
#define _CCP4_VECTOR                             80
#define _CCT4_VECTOR                             81
#define _CCP5_VECTOR                             82
#define _CCT5_VECTOR                             83
#define _CCP6_VECTOR                             84
#define _CCT6_VECTOR                             85
#define _CCP7_VECTOR                             86
#define _CCT7_VECTOR                             87
#define _CCP8_VECTOR                             88
#define _CCT8_VECTOR                             89
#define _CCP9_VECTOR                             90
#define _CCT9_VECTOR                             91
#define _FRC_TUNE_VECTOR                         92
#define _NVM_VECTOR                              94
#define _PERFORMANCE_COUNTER_VECTOR              95
#define _ECCSB_ERR_VECTOR                        97
#define _DMA0_VECTOR                             98
#define _DMA1_VECTOR                             99
#define _DMA2_VECTOR                             100
#define _DMA3_VECTOR                             101

/* Device Peripherals */
#define _ADC
#define _CCP1
#define _CCP2
#define _CCP3
#define _CCP4
#define _CCP5
#define _CCP6
#define _CCP7
#define _CCP8
#define _CCP9
#define _CDAC1
#define _CLC1
#define _CLC2
#define _CLC3
#define _CLC4
#define _CMP1
#define _CMP2
#define _CMP3
#define _CRU
#define _DMAC
#define _DMAC0
#define _DMAC1
#define _DMAC2
#define _DMAC3
#define _FRC
#define _HLVD
#define _I2C1
#define _I2C2
#define _I2C3
#define _INT
#define _NVM
#define _PORTA
#define _PORTB
#define _PORTC
#define _RTCC
#define _SPI1
#define _SPI2
#define _SPI3
#define _TMR1
#define _TMR2
#define _TMR3
#define _UART1
#define _UART2
#define _UART3
#define _USB
#define _USB1
#define _WDT

